{"meta":{"title":"六姑的小站","subtitle":null,"description":null,"author":"六姑","url":"http://auntsix.github.io","root":"/"},"pages":[],"posts":[{"title":"计算机网络基础","slug":"网络基础总结","date":"2019-04-15T10:00:44.035Z","updated":"2019-04-15T05:29:42.870Z","comments":true,"path":"2019/04/15/网络基础总结/","link":"","permalink":"http://auntsix.github.io/2019/04/15/网络基础总结/","excerpt":"","text":"计算机网络基础网络：若干结点和连接这些结点的链路（link）组成网络连接计算机，因特网连接许多网络 ISP（Internet Service Provider）因特网服务提供者(主干ISP、地区ISP、本地ISP) 应用层定义应用进程间通信和交互的规则 运输层负责向两个主机中进程之间的通信提供通用的数据传输服务 （TCP-数据控制协议[提供面向连接的可靠的数据传输服务]UDP-用户数据报协议[提供无连接的尽最大努力的数据传输服务]） 网络层 负责为分组交换网上的不同主机提供通信服务 数据链路层把网络层交下来的IP数据组装成帧(数据+必要控制的信息)物理层 数据链路层信道类型（点对点信道[一对一]、广播信道[一对多]）链路（link）：从一个结点到相邻结点的一段物理线路，而中间没有任何其他的交换结点。数据链路（data link）:把实现这些协议的硬件和软件加到这些链路上。","categories":[],"tags":[]},{"title":"mysql基本使用","slug":"mysql基本用法","date":"2019-04-15T10:00:44.034Z","updated":"2019-04-26T06:25:43.941Z","comments":true,"path":"2019/04/15/mysql基本用法/","link":"","permalink":"http://auntsix.github.io/2019/04/15/mysql基本用法/","excerpt":"","text":"mysql基本使用一、help使用–很好用help + 内容（元素） 二、查用的内容mysql&gt;help contents; &gt;help account –账户管理 ALTER USER – 更改用户说明·原文 The ALTER USER statement modifies MySQL accounts. It enables authentication, SSL/TLS, resource-limit, and password-management properties to be modified for existing accounts, and enables account locking and unlocking. In most cases, ALTER USER requires the global CREATE USER privilege, or the UPDATE privilege for the mysql system database. The exceptions are: o Any client who connects to the server using a nonanonymous account can change the password for that account. To see which account the server authenticated you as, invoke the CURRENT_USER() function: SELECT CURRENT_USER(); o For DEFAULT ROLE syntax, ALTER USER requires these privileges: o Setting the default roles for another user requires the global CREATE USER privilege, or the UPDATE privilege for the mysql.default_roles system table. o Setting the default roles for yourself requires no special privileges, as long as the roles you want as the default have been granted to you. When the read_only system variable is enabled, ALTER USER additionally requires the CONNECTION_ADMIN or SUPER privilege. By default, an error occurs if you try to modify a user that does not exist. If the IF EXISTS clause is given, the statement produces a warning for each named user that does not exist, rather than an error. URL: http://dev.mysql.com/doc/refman/8.0/en/alter-user.html ·翻译 ALTER USER语句修改mysql帐户。它使身份验证、SSL/TLS、资源限制和密码管理要为现有帐户修改的属性，并启用帐户锁定和解锁。 在大多数情况下，ALTER USER 需要全局 CREATE USER 权限，或者mysql系统数据库的 UPDATE 权限。例外情况如下： o使用非匿名帐户连接到服务器的任何客户端可以更改该帐户的密码。看看哪个账户服务器将您验证为，调用CURRENT_USER()函数： SELECT CURRENT_USER(); o对于 DEFAULT ROLE 语法，ALTER USER 需要以下权限： o为其他用户设置默认角色需要全局 CREATE USER 权限，或者对mysql.default_roles系统表的 UPDATE 权限。 o为自己设置默认角色不需要特别的权限，只要您想要的角色是默认的准许你。 启用只读系统变量时，ALTER USER 另外需要 CONNECTION_ADMIN（连接管理）或 SUPER 特权。 默认情况下，如果尝试修改不存在。如果给出 IF EXISTS 子句，则该语句将生成警告每个不存在的命名用户，而不是错误。 Name: &apos;ALTER USER&apos; Description: Syntax: （语法） ALTER USER [IF EXISTS] user [auth_option] [, user [auth_option]] ... [REQUIRE {NONE | tls_option [[AND] tls_option] ...}] [WITH resource_option [resource_option] ...] [password_option | lock_option] ... ALTER USER [IF EXISTS] USER() IDENTIFIED BY &apos;auth_string&apos; ALTER USER [IF EXISTS] user DEFAULT ROLE {NONE | ALL | role [, role ] ...} user: (see ) auth_option: { IDENTIFIED BY &apos;auth_string&apos; | IDENTIFIED WITH auth_plugin | IDENTIFIED WITH auth_plugin BY &apos;auth_string&apos; | IDENTIFIED WITH auth_plugin AS &apos;hash_string&apos; } tls_option: { SSL | X509 | CIPHER &apos;cipher&apos; | ISSUER &apos;issuer&apos; | SUBJECT &apos;subject&apos; } 安全传输层协议（TLS）用于在两个通信应用程序之间提供保密性和数据完整性。 该协议由两层组成： TLS 记录协议（TLS Record）和 TLS 握手协议（TLS Handshake）。 resource_option: { MAX_QUERIES_PER_HOUR count | MAX_UPDATES_PER_HOUR count | MAX_CONNECTIONS_PER_HOUR count | MAX_USER_CONNECTIONS count } password_option: { PASSWORD EXPIRE [DEFAULT | NEVER | INTERVAL N DAY] | PASSWORD HISTORY {DEFAULT | N} | PASSWORD REUSE INTERVAL {DEFAULT | N DAY} } lock_option: { ACCOUNT LOCK | ACCOUNT UNLOCK } CREATE USER – 创建用户说明·原文 The CREATE USER statement creates new MySQL accounts. It enables authentication, SSL/TLS, resource-limit, and password-management properties to be established for new accounts, and controls whether accounts are initially locked or unlocked. To use CREATE USER, you must have the global CREATE USER privilege, or the INSERT privilege for the mysql system database. When the read_only system variable is enabled, CREATE USER additionally requires the CONNECTION_ADMIN or SUPER privilege. CREATE USER either succeeds for all named users or rolls back and has no effect if any error occurs. By default, an error occurs if you try to create a user that already exists. If the IF NOT EXISTS clause is given, the statement produces a warning for each named user that already exists, rather than an error. ·翻译 CREATE USER 语句创建新的mysql帐户。它允许为新帐户建立身份验证、SSL/TLS、资源限制和密码管理属性，并控制帐户最初是锁定还是解锁。 要使用 CREATE USER，您必须具有全局 CREATE USER 权限，或者具有mysql系统数据库的insert权限。当启用只读系统变量时，创建用户还需要 CONNECTION_ADMIN 或 SUPER 特权。 创建用户对于所有命名用户都成功，或者回滚，如果发生任何错误，则不起作用。默认情况下，如果尝试创建已存在的用户，则会发生错误。如果给出 IF NOT EXISTS 子句，则该语句将为已存在的每个命名用户生成一个警告，而不是一个错误。 mysql&gt; help create user Name: &apos;CREATE USER&apos; Description: Syntax: CREATE USER [IF NOT EXISTS] user [auth_option] [, user [auth_option]] ... DEFAULT ROLE role [, role ] ... [REQUIRE {NONE | tls_option [[AND] tls_option] ...}] [WITH resource_option [resource_option] ...] [password_option | lock_option] ... user: (see ) auth_option: { IDENTIFIED BY &apos;auth_string&apos; | IDENTIFIED WITH auth_plugin | IDENTIFIED WITH auth_plugin BY &apos;auth_string&apos; | IDENTIFIED WITH auth_plugin AS &apos;hash_string&apos; } tls_option: { SSL | X509 | CIPHER &apos;cipher&apos; | ISSUER &apos;issuer&apos; | SUBJECT &apos;subject&apos; } resource_option: { MAX_QUERIES_PER_HOUR count | MAX_UPDATES_PER_HOUR count | MAX_CONNECTIONS_PER_HOUR count | MAX_USER_CONNECTIONS count } password_option: { PASSWORD EXPIRE [DEFAULT | NEVER | INTERVAL N DAY] | PASSWORD HISTORY {DEFAULT | N} | PASSWORD REUSE INTERVAL {DEFAULT | N DAY} } lock_option: { ACCOUNT LOCK | ACCOUNT UNLOCK } &gt;help administrationBINLOG CACHE INDEX FLUSH HELP COMMAND KILL LOAD INDEX RESET RESET PERSIST RESTART SET SET CHARACTER SET SET NAMES SHOW SHOW BINARY LOGS SHOW BINLOG EVENTS SHOW CHARACTER SET SHOW COLLATION SHOW COLUMNS SHOW CREATE DATABASE SHOW CREATE EVENT SHOW CREATE FUNCTION SHOW CREATE PROCEDURE SHOW CREATE TABLE SHOW CREATE TRIGGER SHOW CREATE USER SHOW CREATE VIEW SHOW DATABASES SHOW ENGINE SHOW ENGINES SHOW ERRORS SHOW EVENTS SHOW FUNCTION CODE SHOW FUNCTION STATUS SHOW GRANTS SHOW INDEX SHOW MASTER STATUS SHOW OPEN TABLES SHOW PLUGINS SHOW PRIVILEGES SHOW PROCEDURE CODE SHOW PROCEDURE STATUS SHOW PROCESSLIST SHOW PROFILE SHOW PROFILES SHOW RELAYLOG EVENTS SHOW SLAVE HOSTS SHOW SLAVE STATUS SHOW STATUS SHOW TABLE STATUS SHOW TABLES SHOW TRIGGERS SHOW VARIABLES SHOW WARNINGS SHUTDOWN help binlogmysql&gt; help binlog Name: &apos;BINLOG&apos; Description: Syntax: BINLOG &apos;str&apos; BINLOG is an internal-use statement. It is generated by the mysqlbinlog program as the printable representation of certain events in binary log files. (See http://dev.mysql.com/doc/refman/8.0/en/mysqlbinlog.html.) The &apos;str&apos; value is a base 64-encoded string the that server decodes to determine the data change indicated by the corresponding event. This statement requires the BINLOG_ADMIN or SUPER privilege. URL: http://dev.mysql.com/doc/refman/8.0/en/binlog.html help cache indexmysql&gt; help cache index Name: &apos;CACHE INDEX&apos; Description: Syntax: CACHE INDEX tbl_index_list [, tbl_index_list] ... [PARTITION (partition_list | ALL)] IN key_cache_name tbl_index_list: tbl_name [[INDEX|KEY] (index_name[, index_name] ...)] partition_list: partition_name[, partition_name][, ...] The CACHE INDEX statement assigns table indexes to a specific key cache. It is used only for MyISAM tables. After the indexes have been assigned, they can be preloaded into the cache if desired with LOAD INDEX INTO CACHE. The following statement assigns indexes from the tables t1, t2, and t3 to the key cache named hot_cache: mysql&gt; CACHE INDEX t1, t2, t3 IN hot_cache; +---------+--------------------+----------+----------+ | Table | Op | Msg_type | Msg_text | +---------+--------------------+----------+----------+ | test.t1 | assign_to_keycache | status | OK | | test.t2 | assign_to_keycache | status | OK | | test.t3 | assign_to_keycache | status | OK | +---------+--------------------+----------+----------+ URL: http://dev.mysql.com/doc/refman/8.0/en/cache-index.html help flushmysql&gt;help flush Name: &apos;FLUSH&apos; Description: Syntax: FLUSH [NO_WRITE_TO_BINLOG | LOCAL] { flush_option [, flush_option] ... | tables_option } flush_option: { BINARY LOGS | ENGINE LOGS | ERROR LOGS | GENERAL LOGS | HOSTS | LOGS | PRIVILEGES | OPTIMIZER_COSTS | RELAY LOGS [FOR CHANNEL channel] | SLOW LOGS | STATUS | USER_RESOURCES } tables_option: { TABLES | TABLES tbl_name [, tbl_name] ... | TABLES WITH READ LOCK | TABLES tbl_name [, tbl_name] ... WITH READ LOCK | TABLES tbl_name [, tbl_name] ... FOR EXPORT } The FLUSH statement has several variant forms that clear or reload various internal caches, flush tables, or acquire locks. To execute FLUSH, you must have the RELOAD privilege. Specific flush options might require additional privileges, as described later. *Note*: It is not possible to issue FLUSH statements within stored functions or triggers. However, you may use FLUSH in stored procedures, so long as these are not called from stored functions or triggers. See http://dev.mysql.com/doc/refman/8.0/en/stored-program-restrictions.html . By default, the server writes FLUSH statements to the binary log so that they replicate to replication slaves. To suppress logging, specify the optional NO_WRITE_TO_BINLOG keyword or its alias LOCAL. *Note*: FLUSH LOGS, FLUSH TABLES WITH READ LOCK (with or without a table list), and FLUSH TABLES tbl_name ... FOR EXPORT are not written to the binary log in any case because they would cause problems if replicated to a slave. The FLUSH statement causes an implicit commit. See http://dev.mysql.com/doc/refman/8.0/en/implicit-commit.html. The mysqladmin utility provides a command-line interface to some flush operations, using commands such as flush-hosts, flush-logs, flush-privileges, flush-status, and flush-tables. See http://dev.mysql.com/doc/refman/8.0/en/mysqladmin.html. Sending a SIGHUP signal to the server causes several flush operations to occur that are similar to various forms of the FLUSH statement. See http://dev.mysql.com/doc/refman/8.0/en/server-signal-response.html. The RESET statement is similar to FLUSH. See [HELP RESET], for information about using the RESET statement with replication. URL: http://dev.mysql.com/doc/refman/8.0/en/flush.html HELP COMMANDName: &apos;HELP COMMAND&apos; Description: Syntax: mysql&gt; help search_string If you provide an argument to the help command, mysql uses it as a search string to access server-side help from the contents of the MySQL Reference Manual. The proper operation of this command requires that the help tables in the mysql database be initialized with help topic information (see http://dev.mysql.com/doc/refman/8.0/en/server-side-help-support.html). If there is no match for the search string, the search fails: mysql&gt; help me Nothing found Please try to run &apos;help contents&apos; for a list of all accessible topics Use help contents to see a list of the help categories: mysql&gt; help contents You asked for help about help category: &quot;Contents&quot; For more information, type &apos;help &lt;item&gt;&apos;, where &lt;item&gt; is one of the following categories: Account Management Administration Data Definition Data Manipulation Data Types Functions Functions and Modifiers for Use with GROUP BY Geographic Features Language Structure Plugins Storage Engines Stored Routines Table Maintenance Transactions Triggers If the search string matches multiple items, mysql shows a list of matching topics: mysql&gt; help logs Many help items for your request exist. To make a more specific request, please type &apos;help &lt;item&gt;&apos;, where &lt;item&gt; is one of the following topics: SHOW SHOW BINARY LOGS SHOW ENGINE SHOW LOGS Use a topic as the search string to see the help entry for that topic: mysql&gt; help show binary logs Name: &apos;SHOW BINARY LOGS&apos; Description: Syntax: SHOW BINARY LOGS SHOW MASTER LOGS Lists the binary log files on the server. This statement is used as part of the procedure described in [purge-binary-logs], that shows how to determine which logs can be purged. mysql&gt; SHOW BINARY LOGS; +---------------+-----------+ | Log_name | File_size | +---------------+-----------+ | binlog.000015 |724935 | | binlog.000016 |733481 | +---------------+-----------+ The search string can contain the wildcard characters % and _. These have the same meaning as for pattern-matching operations performed with the LIKE operator. For example, HELP rep% returns a list of topics that begin with rep: mysql&gt; HELP rep% Many help items for your request exist. To make a more specific request, please type &apos;help &lt;item&gt;&apos;, where &lt;item&gt; is one of the following topics: REPAIR TABLE REPEAT FUNCTION REPEAT LOOP REPLACE REPLACE FUNCTION URL: http://dev.mysql.com/doc/refman/8.0/en/mysql-server-side-help.html ######KILL mysql&gt; help kill Name: &apos;KILL&apos; Description: Syntax: KILL [CONNECTION | QUERY] processlist_id Each connection to mysqld runs in a separate thread. You can kill a thread with the KILL processlist_id statement. Thread processlist identifiers can be determined from the ID column of the INFORMATION_SCHEMA.PROCESSLIST table, the Id column of SHOW PROCESSLIST output, and the PROCESSLIST_ID column of the Performance Schema threads table. The value for the current thread is returned by the CONNECTION_ID() function. KILL permits an optional CONNECTION or QUERY modifier: o KILL CONNECTION is the same as KILL with no modifier: It terminates the connection associated with the given processlist_id, after terminating any statement the connection is executing. o KILL QUERY terminates the statement the connection is currently executing, but leaves the connection itself intact. If you have the PROCESS privilege, you can see all threads. If you have the CONNECTION_ADMIN or SUPER privilege, you can kill all threads and statements. Otherwise, you can see and kill only your own threads and statements. You can also use the mysqladmin processlist and mysqladmin kill commands to examine and kill threads. URL: http://dev.mysql.com/doc/refman/8.0/en/kill.html LOAD INDEX RESET RESET PERSIST RESTART SET SET CHARACTER SET SET NAMES SHOW SHOW BINARY LOGS SHOW BINLOG EVENTS SHOW CHARACTER SET SHOW COLLATION SHOW COLUMNS SHOW CREATE DATABASE SHOW CREATE EVENT SHOW CREATE FUNCTION SHOW CREATE PROCEDURE SHOW CREATE TABLE SHOW CREATE TRIGGER SHOW CREATE USER SHOW CREATE VIEW SHOW DATABASES SHOW ENGINE SHOW ENGINES SHOW ERRORS SHOW EVENTS SHOW FUNCTION CODE SHOW FUNCTION STATUS SHOW GRANTS SHOW INDEX SHOW MASTER STATUS SHOW OPEN TABLES SHOW PLUGINS SHOW PRIVILEGES SHOW PROCEDURE CODE SHOW PROCEDURE STATUS SHOW PROCESSLIST SHOW PROFILE SHOW PROFILES SHOW RELAYLOG EVENTS SHOW SLAVE HOSTS SHOW SLAVE STATUS SHOW STATUS SHOW TABLE STATUS SHOW TABLES SHOW TRIGGERS SHOW VARIABLES SHOW WARNINGS SHUTDOWN &gt;help components –组件INSTALL COMPONENT 安装组件 UNINSTALL COMPONENT 卸载组件 UNINSTALL PLUGIN 卸载插件 INSTALL COMPONENTSyntax: INSTALL COMPONENT component_name [, component_name ] ... .说明 This statement installs one or more server components,which become active immediately. A component provides services that are available to the server and other components; see http://dev.mysql.com/doc/refman/8.0/en/server-components.html. INSTALL COMPONENT requires the INSERT privilege for the mysql.component system table. .翻译 此语句安装一个或多个服务器组件，这些组件将立即变为活动的。组件提供的服务服务器和其他组件； 请参阅http://dev.mysql.com/doc/refman/8.0/en/server-components.html。 安装组件需要mysql.component系统表的insert特权。 UNINSTALL COMPONENTSyntax: UNINSTALL COMPONENT component_name [, component_name ] ... .说明 This statement deactivates and uninstalls one or more server components. A component provides services that are available to the server and other components; see http://dev.mysql.com/doc/refman/8.0/en/server-components.html. UNINSTALL COMPONENT is the complement of INSTALL COMPONENT.It requires the DELETE privilege for the mysql.component system table. .翻译 此语句将停用并卸载一个或多个服务器组件。组件提供服务器和其他组件可用的服务； 请参阅http://dev.mysql.com/doc/refman/8.0/en/server-components.html。 uninstall组件是install组件的补充，它需要mysql.component系统表的delete权限。 Example: UNINSTALL COMPONENT &apos;file://component1&apos;, &apos;file://component2&apos;; For information about component naming, see [HELP INSTALL COMPONENT]. If any error occurs, the statement fails and has no effect. For example, this happens if a component name is erroneous, a named component is not installed, or cannot be uninstalled because other installed components depend on it. A loader service handles component unloading, which includes removing uninstalled components from the mysql.component system table that serves as a registry. As a result, unloaded components are not loaded during the startup sequence for subsequent server restarts. URL: http://dev.mysql.com/doc/refman/8.0/en/uninstall-component.html UNINSTALL PLUGINSyntax: UNINSTALL PLUGIN plugin_name This statement removes an installed server plugin. It requires the DELETE privilege for the mysql.plugin system table. UNINSTALL PLUGIN is the complement of INSTALL PLUGIN. plugin_name must be the name of some plugin that is listed in the mysql.plugin table. The server executes the plugin&apos;s deinitialization function and removes the row for the plugin from the mysql.plugin table, so that subsequent server restarts will not load and initialize the plugin. UNINSTALL PLUGIN does not remove the plugin&apos;s shared library file. URL: http://dev.mysql.com/doc/refman/8.0/en/uninstall-plugin.html &gt;help Compound StatementsBEGIN END CASE STATEMENT CLOSE DECLARE CONDITION DECLARE CURSOR DECLARE HANDLER DECLARE VARIABLE FETCH GET DIAGNOSTICS IF STATEMENT ITERATE LABELS LEAVE LOOP OPEN REPEAT LOOP RESIGNAL RETURN SIGNAL WHILE &gt;help Data ManipulationCALL DELETE DO DUAL HANDLER IMPORT TABLE INSERT INSERT DELAYED INSERT SELECT JOIN LOAD DATA LOAD XML REPLACE SELECT UNION UPDATE &gt;help Data DefinitionALTER DATABASE ALTER EVENT ALTER FUNCTION ALTER INSTANCE ALTER PROCEDURE ALTER SERVER ALTER TABLE ALTER TABLESPACE ALTER VIEW CONSTRAINT CREATE DATABASE CREATE EVENT CREATE FUNCTION CREATE INDEX CREATE PROCEDURE CREATE SERVER CREATE SPATIAL REFERENCE SYSTEM CREATE TABLE CREATE TABLESPACE CREATE TRIGGER CREATE VIEW DROP DATABASE DROP EVENT DROP FUNCTION DROP INDEX DROP PROCEDURE DROP SERVER DROP SPATIAL REFERENCE SYSTEM DROP TABLE DROP TABLESPACE DROP TRIGGER DROP VIEW RENAME TABLE TRUNCATE TABLE &gt;help data typesAUTO_INCREMENT BIGINT BINARY BIT BLOB BLOB DATA TYPE BOOLEAN CHAR CHAR BYTE DATE DATETIME DEC DECIMAL DOUBLE DOUBLE PRECISION ENUM FLOAT INT INTEGER LONGBLOB LONGTEXT MEDIUMBLOB MEDIUMINT MEDIUMTEXT SET DATA TYPE SMALLINT TEXT TIME TIMESTAMP TINYBLOB TINYINT TINYTEXT VARBINARY VARCHAR YEAR DATA TYPE &gt;help functionsBit Functions Comparison operators Control flow functions Date and Time Functions Encryption Functions Information Functions Logical operators Miscellaneous Functions Numeric Functions String Functions &gt;help Functions and Modifiers for Use with GROUP BYAVG BIT_AND BIT_OR BIT_XOR COUNT COUNT DISTINCT CUME_DIST DENSE_RANK FIRST_VALUE GROUP_CONCAT JSON_ARRAYAGG JSON_OBJECTAGG LAG LAST_VALUE LEAD MAX MIN NTH_VALUE NTILE PERCENT_RANK RANK ROW_NUMBER STD STDDEV STDDEV_POP STDDEV_SAMP SUM VARIANCE VAR_POP VAR_SAMP &gt;help Geographic Featurestopics: GEOMETRY GEOMETRY HIERARCHY SPATIAL categories: Geometry constructors Geometry properties Geometry relations LineString properties MBR Point properties Polygon properties WKB WKT &gt;help help metadata –帮助元数据HELP_DATE HELP_VERSION mysql&gt; help help_date Name: &apos;HELP_DATE&apos; Description: This help information was generated from the MySQL 8.0 Reference Manual on: 2018-07-12 mysql&gt; help help_version Name: &apos;HELP_VERSION&apos; Description: This help information was generated from the MySQL 8.0 Reference Manual on: 2018-07-12 (revision: 58077) This information applies to MySQL 8.0 through 8.0.14. &gt;help Language Structure –语言结构mysql&gt; help Language Structure Name: &apos;Language Structure&apos; Description: TRUE FALSEExamples: N &gt;help Plugins – 插件Name: &apos;SHOW PLUGINS&apos; Description: Syntax: SHOW PLUGINS SHOW PLUGINS displays information about server plugins. Plugin information is also available in the INFORMATION_SCHEMA.PLUGINS table. See http://dev.mysql.com/doc/refman/8.0/en/plugins-table.html. Example of SHOW PLUGINS output: mysql&gt; SHOW PLUGINS\\G *************************** 1. row *************************** Name: binlog Status: ACTIVE Type: STORAGE ENGINE Library: NULL License: GPL *************************** 2. row *************************** Name: CSV Status: ACTIVE Type: STORAGE ENGINE Library: NULL License: GPL *************************** 3. row *************************** Name: MEMORY Status: ACTIVE Type: STORAGE ENGINE Library: NULL License: GPL *************************** 4. row *************************** Name: MyISAM Status: ACTIVE Type: STORAGE ENGINE Library: NULL License: GPL ... URL: http://dev.mysql.com/doc/refman/8.0/en/show-plugins.html &gt;help Storage Engines – 存储引擎mysql&gt; help storage engines Name: &apos;Storage Engines&apos; Description: MERGEExamples: N &gt;help Table Maintenance – 表格维护ANALYZE TABLE CHECK TABLE CHECKSUM TABLE OPTIMIZE TABLE REPAIR TABLE &gt;help Transaction –事务 CHANGE MASTER TO CHANGE REPLICATION FILTER DEALLOCATE PREPARE EXECUTE STATEMENT ISOLATION LOCK LOCK INSTANCE FOR BACKUP PREPARE PURGE BINARY LOGS RESET MASTER RESET SLAVE SAVEPOINT SET GLOBAL SQL_SLAVE_SKIP_COUNTER SET SQL_LOG_BIN START SLAVE START TRANSACTION STOP SLAVE XA &gt;help User-Defined Functions –自定义功能CREATE FUNCTION UDF DROP FUNCTION UDF CREATE FUNCTION UDFmysql&gt; help create function udf Syntax: CREATE [AGGREGATE] FUNCTION function_name RETURNS {STRING|INTEGER|REAL|DECIMAL} SONAME shared_library_name ·说明 A user-defined function (UDF) is a way to extend MySQL with a new function that works like a native (built-in) MySQL function such as ABS() or CONCAT(). function_name is the name that should be used in SQL statements to invoke the function. The RETURNS clause indicates the type of the function&apos;s return value. DECIMAL is a legal value after RETURNS, but currently DECIMAL functions return string values and should be written like STRING functions. shared_library_name is the base name of the shared library file that contains the code that implements the function. The file must be located in the plugin directory. This directory is given by the value of the plugin_dir system variable. For more information, see http://dev.mysql.com/doc/refman/8.0/en/udf-compiling.html. To create a function, you must have the INSERT privilege for the mysql system database. This is necessary because CREATE FUNCTION adds a row to the mysql.func system table that records the function&apos;s name, type, and shared library name. If you do not have this table, you should run the mysql_upgrade command to create it. See http://dev.mysql.com/doc/refman/8.0/en/mysql-upgrade.html. UDFs registered using CREATE FUNCTION are listed in the Performance Schema user_defined_functions table; see http://dev.mysql.com/doc/refman/8.0/en/user-defined-functions-table.html. URL: http://dev.mysql.com/doc/refman/8.0/en/create-function-udf.html ·翻译 用户定义函数（udf）是一种使用新函数扩展mysql的方法，该函数的工作方式类似于原生（内置）mysql函数，如abs（）或concat（）。 函数名是在SQL语句中用来调用函数的名称。RETURNS 子句指示函数返回值的类型。 DECIMAL 是 RETURNS 的合法值，但当前 RETURNS 函数返回字符串值，应该像字符串函数一样写入。 shared_library_name是包含实现函数的代码的共享库文件的基名称。文件必须位于插件目录中。这个目录由plugin_dir系统变量的值给出。更多信息，请参阅http://dev.mysql.com/doc/refman/8.0/en/udf-compiling.html。 要创建函数，您必须具有MySQL系统数据库的 INSERT 权限。这是必需的，因为 CREATE FUNCTION 向mysql.func系统表中添加一行，记录函数的名称、类型和共享库名称。如果没有这个表，应该运行mysql_upgrade命令来创建它 请参阅http://dev.mysql.com/doc/refman/8.0/en/mysql-upgrade.html。 使用 CREATE FUNCTION 注册的UDF列在性能模式用户定义的_函数表中；请参阅http://dev.mysql.com/doc/refman/8.0/en/user-defined-functions-table.html。 网址：http://dev.mysql.com/doc/refman/8.0/en/create-function-udf.html DROP FUNCTION UDFmysql&gt; help drop function udf Syntax: DROP FUNCTION function_name ·说明 This statement drops the user-defined function (UDF) named function_name. To drop a function, you must have the DELETE privilege for the mysql system database. This is because DROP FUNCTION removes a row from the mysql.func system table that records the function&apos;s name, type, and shared library name. URL: http://dev.mysql.com/doc/refman/8.0/en/drop-function-udf.html ·翻译 此语句将删除名为“ function_name ”的用户定义函数（UDF）。 要删除函数，您必须具有MySQL系统数据库的 DELETE 权限。这是因为 DROP FUNCTION 从mysql.func系统表中删除了一行，记录了函数的名称、类型和共享库名称。 网址：http://dev.mysql.com/doc/refman/8.0/en/drop-function-udf.html &gt;help Utility –效用EXPLAIN HELP STATEMENT USE","categories":[],"tags":[]}]}